In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from datetime import datetime 

matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [5]:
data = np.random.randint(1,10, size=4)
data

array([4, 8, 2, 3])

In [7]:
data = np.random.randint(30,101, size=(4,6) )
data

array([[ 39,  43,  33,  50,  82, 100],
       [ 71,  53,  89,  73,  37,  34],
       [ 40,  34,  41,  55,  61,  72],
       [ 37,  63,  78,  66,  57,  50]])

In [24]:
df = pd.DataFrame( data )
# df.columns= ['국어','수학','영어','미술','체육','실과']
df['년도'] = [2018,2018,2019,2019]
df['반'] = ['1반','2반','1반','2반']
df

    0   1   2   3   4    5    년도   반
0  39  43  33  50  82  100  2018  1반
1  71  53  89  73  37   34  2018  2반
2  40  34  41  55  61   72  2019  1반
3  37  63  78  66  57   50  2019  2반

### 1. set_index( ['멀티 인덱스로 설정할 컬럼'])
- Set the DataFrame index using existing columns.

In [25]:
df.set_index( ['년도','반'] )

          0   1   2   3   4    5
년도   반
2018 1반  39  43  33  50  82  100
     2반  71  53  89  73  37   34
2019 1반  40  34  41  55  61   72
     2반  37  63  78  66  57   50

In [26]:
df

    0   1   2   3   4    5    년도   반
0  39  43  33  50  82  100  2018  1반
1  71  53  89  73  37   34  2018  2반
2  40  34  41  55  61   72  2019  1반
3  37  63  78  66  57   50  2019  2반

### 2. pd.MultiIndex.from_product( )

In [30]:
pd.MultiIndex.from_product( [[2018,2019],['1반','2반']], names=['년도','반'] )

MultiIndex([(2018, '1반'),
            (2018, '2반'),
            (2019, '1반'),
            (2019, '2반')],
           names=['년도', '반'])

In [43]:
df.index = pd.MultiIndex.from_product( [[2018,2019],['1반','2반']], names=['년도','반'] )
df.drop( columns=['년도','반'], inplace=True)

In [44]:
df.index

MultiIndex([(2018, '1반'),
            (2018, '2반'),
            (2019, '1반'),
            (2019, '2반')],
           names=['년도', '반'])

### (1) MultiIndex 속성
- df.index.levels[ 0 ]
- df.index.get_level_values( 0 )

In [45]:
df.index

MultiIndex([(2018, '1반'),
            (2018, '2반'),
            (2019, '1반'),
            (2019, '2반')],
           names=['년도', '반'])

In [46]:
df.index.levels[0]

Int64Index([2018, 2019], dtype='int64', name='년도')

In [47]:
df.index.levels[1]

Index(['1반', '2반'], dtype='object', name='반')

In [48]:
df.index.get_level_values(0)

Int64Index([2018, 2018, 2019, 2019], dtype='int64', name='년도')

In [49]:
df.index.get_level_values(1)

Index(['1반', '2반', '1반', '2반'], dtype='object', name='반')

In [50]:
df

          0   1   2   3   4    5
년도   반
2018 1반  39  43  33  50  82  100
     2반  71  53  89  73  37   34
2019 1반  40  34  41  55  61   72
     2반  37  63  78  66  57   50

### df.reset_index() 
- <-> df.set_index()
- 인덱스를 컬러으로 바꿔줌

In [51]:
df.reset_index()

     년도   반   0   1   2   3   4    5
0  2018  1반  39  43  33  50  82  100
1  2018  2반  71  53  89  73  37   34
2  2019  1반  40  34  41  55  61   72
3  2019  2반  37  63  78  66  57   50

In [52]:
df

          0   1   2   3   4    5
년도   반
2018 1반  39  43  33  50  82  100
     2반  71  53  89  73  37   34
2019 1반  40  34  41  55  61   72
     2반  37  63  78  66  57   50

In [54]:
df.loc[2018]

     0   1   2   3   4    5
반
1반  39  43  33  50  82  100
2반  71  53  89  73  37   34

In [55]:
df.loc[2019]

     0   1   2   3   4   5
반
1반  40  34  41  55  61  72
2반  37  63  78  66  57  50

# 멀티컬럼

In [63]:
df.columns = pd.MultiIndex.from_product( [['홍길동','박수홍','임꺽정'],['국어','영어']]
                                        )
df

        홍길동     박수홍     임꺽정
         국어  영어  국어  영어  국어   영어
년도   반
2018 1반  39  43  33  50  82  100
     2반  71  53  89  73  37   34
2019 1반  40  34  41  55  61   72
     2반  37  63  78  66  57   50

In [64]:
df.columns # 멀티 컬럼이다

MultiIndex([('홍길동', '국어'),
            ('홍길동', '영어'),
            ('박수홍', '국어'),
            ('박수홍', '영어'),
            ('임꺽정', '국어'),
            ('임꺽정', '영어')],
           )

In [66]:
df.columns.levels[0]

Index(['박수홍', '임꺽정', '홍길동'], dtype='object')

In [67]:
df.columns.levels[1]

Index(['국어', '영어'], dtype='object')

In [71]:
df.columns.get_level_values(0)

Index(['홍길동', '홍길동', '박수홍', '박수홍', '임꺽정', '임꺽정'], dtype='object')

In [69]:
df.columns.get_level_values(1)

Index(['국어', '영어', '국어', '영어', '국어', '영어'], dtype='object')

In [74]:
df['홍길동']

         국어  영어
년도   반
2018 1반  39  43
     2반  71  53
2019 1반  40  34
     2반  37  63